# Creating Databases and Tables

https://www.datacamp.com/courses/introduction-to-relational-databases-in-python

First, you should open your Mysql and create an empty database which name is "datacamp_course" in our example.

## Importing Libraries

In [1]:
from sqlalchemy import create_engine
from sqlalchemy import MetaData, Table
from sqlalchemy import Table, Column, String, Integer, Float, Boolean
from sqlalchemy import select

## Connecting to Just Created Empty Database

In [2]:
# Create an engine to the census database
engine = create_engine("mysql+pymysql://root:pass@localhost:8800/datacamp_course")

# Use the .table_names() method on the engine to print the table names
print(engine.table_names())

[]

## Creating Tables with SQLAlchemy

We will create a table named 'data'

Previously, you used the Table object to reflect a table from an existing database, but what if you wanted to create a new table? You'd still use the Table object; however, you'd need to replace the autoload and autoload_with parameters with Column objects.

In [3]:
# Import Table, Column, String, Integer, Float, Boolean from sqlalchemy
from sqlalchemy import Table, Column, String, Integer, Float, Boolean
metadata = MetaData()

# Define a new table with a name, count, amount, and valid column: data
data = Table('data', metadata,
             Column('name', String(255)),
             Column('count', Integer()),
             Column('amount', Float()),
             Column('valid', Boolean())
)

# Use the metadata to create the table
metadata.create_all(engine)

# Print table details
print(repr(data))

Table('data', MetaData(bind=None), Column('name', String(length=255), table=<data>), Column('count', Integer(), table=<data>), Column('amount', Float(), table=<data>), Column('valid', Boolean(), table=<data>), schema=None)

## Constraints and Data Defaults

Now, we'll create a new table as data2 with constraints and defaults.

You're now going to practice creating a table with some constraints! Often, you'll need to make sure that a column is unique, nullable, a positive value, or related to a column in another table. This is where constraints come in.

In addition to constraints, you can also set a default value for the column if no data is passed to it via the default keyword on the column.

In [4]:

# Define a new table with a name, count, amount, and valid column: data
data2 = Table('data2', metadata,
             Column('name', String(255), unique=True),
             Column('count', Integer(), default=1),
             Column('amount', Float()),
             Column('valid', Boolean(), default=False)
)

# Use the metadata to create the table
metadata.create_all(engine)

# Print the table details
print(repr(metadata.tables['data2']))

Table('data2', MetaData(bind=None), Column('name', String(length=255), table=<data2>), Column('count', Integer(), table=<data2>, default=ColumnDefault(1)), Column('amount', Float(), table=<data2>), Column('valid', Boolean(), table=<data2>, default=ColumnDefault(False)), schema=None)

## Inserting a single row with an insert() statement

In [5]:
# Import insert from sqlalchemy
from sqlalchemy import insert, select

# Build an insert statement to insert a record into the data table: stmt
stmt = insert(data).values(name='Anna', count=1, amount=1000.00, valid=True)

# Execute the statement via the connection: results
connection = engine.connect()
results = connection.execute(stmt)

# Print result rowcount
print(results.rowcount)

# Build a select statement to validate the insert
stmt = select([data]).where(data.columns.name == 'Anna')

# Print the result of executing the query.
print(connection.execute(stmt).first())

1
('Anna', 1, 1000.0, True)

## Inserting Multiple Records at Once

In [6]:
# Build a list of dictionaries: values_list
values_list = [
    {'name': 'Anna', 'count': 1, 'amount': 1000.00, 'valid': True},
    {'name': 'Taylor', 'count': 1, 'amount': 750.00, 'valid': False},
    {'name': 'Okan', 'count': 1, 'amount': 2000.00, 'valid': True},
    {'name': 'Arda', 'count': 1, 'amount': 2000.00, 'valid': True}
]

# Build an insert statement for the data table: stmt
stmt = insert(data2)

# Execute stmt with the values_list: results
results = connection.execute(stmt, values_list)

# Print rowcount
print(results.rowcount)

4

## Loading a CSV into a Table

In [7]:
import pandas as pd
df = pd.read_csv('census.csv')
df.to_sql('census', con=engine, index=False)

In [8]:
census = Table('census', metadata, autoload=True, autoload_with=engine)

In [9]:
census.columns.keys()

['Illinois', 'M', '0', '89600', '95012']

In [10]:
stmt = select([census])
results = engine.connect().execute(stmt).fetchall()
print(results[:10])

[('Illinois', 'M', 1, 88445, 91829), ('Illinois', 'M', 2, 88729, 89547), ('Illinois', 'M', 3, 88868, 90037), ('Illinois', 'M', 4, 91947, 91111), ('Illinois', 'M', 5, 93894, 89802), ('Illinois', 'M', 6, 93676, 88931), ('Illinois', 'M', 7, 94818, 90940), ('Illinois', 'M', 8, 95035, 86943), ('Illinois', 'M', 9, 96436, 86055), ('Illinois', 'M', 10, 97280, 86565)]

In [13]:
df = pd.DataFrame(results) 
df.columns=['state', 'sex', 'age', 'pop2000', 'pop2008']
df.head()

      state sex  age  pop2000  pop2008
0  Illinois   M    1    88445    91829
1  Illinois   M    2    88729    89547
2  Illinois   M    3    88868    90037
3  Illinois   M    4    91947    91111
4  Illinois   M    5    93894    89802

Note: Read also https://towardsdatascience.com/sqlalchemy-python-tutorial-79a577141a91